#include "io.h"
#include "i2c.h"

void IoInit()
{
    EAXFR = 1;
    WTST = 0;   //设置程序指令延时参数，赋值为0可将CPU执行指令的速度设置为最快

    P0M1 = 0x00;   P0M0 |= (1<<1)|(1<<2)|(1<<5) ;       //P0.0 P0.1 P0.4 推挽输出
    P1M1 = 0x00;   P1M0 |= (1<<4)|(1<<5);               //设置为准双向口
    P2M1 = 0x00;   P2M0 |= (1<<0);                      //P2.2 推挽输出
    P3M1 = 0x00;   P3M0 = 0x00;        //设置为准双向口
    P4M1 = 0x00;   P4M0 |= (1<<2)|(1<<3)|(1<<4);        //设置为准双向
    P5M1 = 0x00;   P5M0 |= (1<<2)|(1<<3);             //设置为准双向口
}



